high-level-tests/load-testing/scenarios/authenticate-and-upload-certification-session-candidate.yaml
config:
  phases:
    - duration: 1
      arrivalRate: 1
      name: Warm up

  plugins:
    expect: { }

scenarios:
  - name: "Connexion et upload candidats"
    flow:
      # Authenticate user
      - post:
          url: "/api/token"
          headers:
            content-type: "application/x-www-form-urlencoded"
          body: "grant_type=password&scope=mon-pix&username=certifsup@example.net&password=pix123"
          capture:
            - json: "$.access_token"
              as: "accessToken"
            - json: "$.user_id"
              as: "userId"
          expect:
            - statusCode: 200

      # Upload candidate file
      - function: "setVarInContext"
      - post:
          url: "/api/sessions/11/certification-candidates/import"
          headers:
            Authorization: "Bearer {{ accessToken }}"
            Content-Type: "multipart/form-data; boundary=----WebKitFormBoundaryzUiKnq4NxBWIkBcR"
            Accept: "application/json,text/javascript"
            Accept-language: "en-US,en;q=0.9"
            Accept-encoding: "gzip, deflate, br"
          body: "{{ candidates }}"
          expect:
            - statusCode: 400