high-level-tests/load-testing/scenarios/import-schooling-registration.yml
config:
  phases:
    - duration: 10     # in seconds
      arrivalRate: 1   # action per second
scenarios:
  - name: 'Import du fichier SIECLE'
    flow:

      # Authenticate user
      - post:
          url: "/api/token"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "grant_type=password&username=sco.admin%40example.net&password=pix123&scope=pix-orga"

          capture:
            - json: "$.access_token"
              as: "accessToken"
            - json: "$.user_id"
              as: "userId"

      # Get user profile to check token
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Import XML file
      - function: "loadXMLFile"
      - post:
          url: "/api/organizations/3/schooling-registrations/import-siecle?format=xml"
          headers:
            Authorization: "Bearer {{ accessToken }}"
            Content-Type: "application/xml"
          body:  "{{ XML }}"