high-level-tests/load-testing/scenarios/import-schooling-registration.yml
config:
  phases:
    #  duration unit is in seconds
    #  Arrival rate = Virtual user count per second
    #  Arrival rate = 10 => In 1 second, 10 VU are created and execute the scenario
    - duration: 10
      arrivalRate: 1
      name: "Start with minimal load"
    - pause: 10
      name: "Pause a bit to cool down"
    - duration: 60
      arrivalRate: 0
      rampTo: 10
      name: "Ramp up to maximum load"
    - pause: 10
    - duration: 120
      arrivalRate: 10
      name: "Sustain maximum load"
  http:
    # Use Scalingo 30 second timeout
    # From https://doc.scalingo.com/platform/internals/routing#timeouts
    # Default Artillery is 120 seconds
    # From https://artillery.io/docs/http-reference/#request-timeout
    timeout: 30
scenarios:
  - name: 'Import du fichier SIECLE'
    flow:

      # Authenticate user
      - post:
          url: "/api/token"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          body: "grant_type=password&username=sco.admin%40example.net&password=pix123&scope=pix-orga"

          capture:
            - json: "$.access_token"
              as: "accessToken"
            - json: "$.user_id"
              as: "userId"

      # Get user profile to check token
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Import XML file
      - function: "setVarInContext"
      - post:
          url: "/api/organizations/3/schooling-registrations/import-siecle?format=xml"
          headers:
            Authorization: "Bearer {{ accessToken }}"
            Content-Type: "application/xml"
          body:  "{{ schoolingRegistrationXMLFormat }}"